alunmorris/ESP32-AI-chatbot-terminals/src/main.cpp
// Slide the SLUG logo off to the right over 1 second
void slideOutSlug() {
    const int    imgX0 = SCREEN_W - SLUGSMALL_W;   // 176
    const int    imgY  = 20;
    const unsigned long dur = 1000UL;
    unsigned long t0 = millis();
    int prevX = imgX0;
    while (true) {
        unsigned long elapsed = millis() - t0;
        if (elapsed >= dur) break;
        int x = imgX0 + (int)((long)SLUGSMALL_W * elapsed / dur);
        if (x > prevX) {
            // Erase only the newly-exposed left strip (no transparent holes to worry about)
            tft.fillRect(prevX, imgY, x - prevX, SLUGSMALL_H, COL_BG);
            if (x < SCREEN_W)
                tft.pushImage(x, imgY, SLUGSMALL_W, SLUGSMALL_H, SLUG_SMALL);
            prevX = x;
        }
        delay(16);
    }
    tft.fillRect(imgX0, imgY, SLUGSMALL_W, SLUGSMALL_H, COL_BG);
}

void showModelChoices() {
    // Slug logo top-right (below the two help lines, clear of left-aligned model text)
    tft.pushImage(SCREEN_W - SLUGSMALL_W, 20, SLUGSMALL_W, SLUGSMALL_H, SLUG_SMALL);

    uiFontOn();
    tft.setTextColor(TFT_WHITE, COL_BG);
    int optY = 20 + TXT_H + 4;  // start below the two header lines
    tft.setCursor(0, optY); tft.print("Hit 1 for Gemini 2.5 Flash"); optY += TXT_H;
    tft.setCursor(0, optY); tft.print("    2 for Gemini 3 Flash");   optY += TXT_H;
    tft.setCursor(0, optY); tft.print("    3 for Gemini 3.1 Pro");   optY += TXT_H;
    tft.setCursor(0, optY); tft.print("    4 for Grok 4.1 Fast");    optY += TXT_H;
    tft.setCursor(0, optY); tft.print("    5 for Groq OSS-120b");    optY += TXT_H;
    if (!largeFont) {
        tft.setCursor(0, optY); tft.print("    b for bigger font");  optY += TXT_H;
    }
    if (!invertDisplay) {
        tft.setCursor(0, optY); tft.print("    i to invert colours"); optY += TXT_H;
    }
    uiFontOff();
}

void selectModel() {
    static const char* modelIds[]    = {
        "gemini-2.5-flash",
        "gemini-3-flash-preview",
        "gemini-3.1-pro-preview"
    };
    static const bool  modelGlobal[] = { true, true, false };

    showModelChoices();

    while (true) {
        InputEvent ev;
        if (!halPollInput(&ev)) { delay(10); continue; }
        if (ev.type != INPUT_CHAR) continue;
        char ch = ev.ch;

        // Models 1–3 (Gemini)
        if (ch >= '1' && ch <= '3') {
            int i = ch - '1';
            halClickSound();
            slideOutSlug();
            strncpy(GEMINI_MODEL, modelIds[i], 47); GEMINI_MODEL[47] = '\0';
            geminiUseGlobal = modelGlobal[i];
            useGrok = false; useGroq = false;
            uint16_t bg = invertDisplay ? COL_INVERT_BG : COL_BG;
            tft.fillRect(0, 0, SCREEN_W, HIST_H_KB_SHOW, bg);
            if (largeFont) {
                fontOn();
                tft.setTextColor(TFT_GREEN, bg);
                tft.drawString("SLUG AI chatbot", 0, 0);
                tft.drawString(GEMINI_MODEL, 0, LINE_H_LARGE);
                tft.setTextColor(TFT_DARKGREY, bg);
                tft.drawString("Ready.", 0, 2 * LINE_H_LARGE);
                fontOff();
            } else {
                uiFontOn();
                tft.setTextColor(TFT_GREEN, bg);
                tft.setCursor(0,        0); tft.print("SLUG AI Chatbot v0.2");
                tft.setCursor(0,   TXT_H); tft.print("Model: "); tft.print(GEMINI_MODEL);
                tft.setTextColor(TFT_DARKGREY, bg);
                tft.setCursor(0, 2*TXT_H); tft.print("Ready.");
                uiFontOff();
            }
            return;
        }
        if (ch == '4') {
            halClickSound();
            slideOutSlug();
            useGrok = true; useGroq = false;
            uint16_t bg = invertDisplay ? COL_INVERT_BG : COL_BG;
            tft.fillRect(0, 0, SCREEN_W, HIST_H_KB_SHOW, bg);
            if (largeFont) {
                fontOn();
                tft.setTextColor(TFT_GREEN, bg);
                tft.drawString("SLUG AI Chatbot", 0, 0);
                tft.drawString("Grok 4.1 Fast", 0, LINE_H_LARGE);
                tft.setTextColor(TFT_DARKGREY, bg);
                tft.drawString("Ready.", 0, 2 * LINE_H_LARGE);
                fontOff();
            } else {
                uiFontOn();
                tft.setTextColor(TFT_GREEN, bg);
                tft.setCursor(0,        0); tft.print("SLUG AI Chatbot");
                tft.setCursor(0,   TXT_H); tft.print("Model: Grok 4.1 Fast");
                tft.setTextColor(TFT_DARKGREY, bg);
                tft.setCursor(0, 2*TXT_H); tft.print("Ready.");
                uiFontOff();
            }
            return;
        }
        if (ch == '5') {
            halClickSound();
            slideOutSlug();
            useGroq = true; useGrok = false;
            uint16_t bg = invertDisplay ? COL_INVERT_BG : COL_BG;
            tft.fillRect(0, 0, SCREEN_W, HIST_H_KB_SHOW, bg);
            if (largeFont) {
                fontOn();
                tft.setTextColor(TFT_GREEN, bg);
                tft.drawString("SLUG AI chatbot", 0, 0);
                tft.drawString("Groq GPT-OSS-120b", 0, LINE_H_LARGE);
                tft.setTextColor(TFT_DARKGREY, bg);
                tft.drawString("Ready.", 0, 2 * LINE_H_LARGE);
                fontOff();
            } else {
                uiFontOn();
                tft.setTextColor(TFT_GREEN, bg);
                tft.setCursor(0,        0); tft.print("SLUG AI chatbot");
                tft.setCursor(0,   TXT_H); tft.print("Model: Groq GPT-OSS-120b");
                tft.setTextColor(TFT_DARKGREY, bg);
                tft.setCursor(0, 2*TXT_H); tft.print("Ready.");
                uiFontOff();
            }
            return;
        }
        if (ch == 'b' || ch == 'B') {
            largeFont = !largeFont;
            tft.fillRect(0, 0, SCREEN_W, HIST_H_KB_SHOW, COL_BG);
            uiFontOn(); tft.setTextColor(TFT_DARKGREY, COL_BG);
            tft.setCursor(0,      0); tft.print("SLUG AI chatbot");
            tft.setCursor(0, TXT_H); tft.print("Select AI model:");
            uiFontOff();
            showModelChoices();
            continue;
        }
        if (ch == 'i' || ch == 'I') {
            invertDisplay = !invertDisplay;
            tft.fillRect(0, 0, SCREEN_W, HIST_H_KB_SHOW, COL_BG);
            uiFontOn(); tft.setTextColor(TFT_DARKGREY, COL_BG);
            tft.setCursor(0,      0); tft.print("SLUG AI chatbot");
            tft.setCursor(0, TXT_H); tft.print("Select AI model:");
            uiFontOff();
            showModelChoices();
            continue;
        }
#ifndef TARGET_C3
        if (ch == 'c' || ch == 'C') {
            calibrateTouch();
            tft.fillScreen(COL_BG);
            uiFontOn(); tft.setTextColor(TFT_DARKGREY, COL_BG);
            tft.setCursor(0,      0); tft.print("SLUG AI chatbot");
            tft.setCursor(0, TXT_H); tft.print("Select AI model:");
            uiFontOff();
            drawKeyboard();
            drawInputBar(); showModelChoices();
            continue;
        }
#endif
    }
}

void setup() {
    loadWifiCreds();   // load NVS; shows AP picker on first boot if no credentials stored

#ifndef TARGET_C3
    // Hold BOOT button (GPIO0) on power-on to wipe touch calibration back to defaults
    pinMode(0, INPUT_PULLUP);
    if (digitalRead(0) == LOW) {
        Preferences p;
        p.begin("touch", false);
        p.remove("valid");
        p.remove("orient");
        p.end();
        Serial.begin(115200);
        Serial.println("[Cal] Reset to defaults via BOOT button");
        delay(500);
    }
#endif
    Serial.begin(115200);
#ifndef TARGET_C3
    Serial.println("[Cal] Loaded touch calibration from NVS");
#endif
    waitMsgIdx = random(NUM_WAIT_MSGS);
    // Display (init before backlight to avoid white flash)
    tft.init();
#ifdef TARGET_C3
    // ST7789 GRAM is 240col x 320row (portrait-native). Pre-fill all GRAM in
    // rotation 0 (CASET 0..239, RASET 0..319 both valid) so that GRAM rows
    // 240..319 contain COL_BG rather than power-on white. Without this, those
    // rows map to a visible white strip in some landscape rotations.
    tft.setRotation(0);
    tft.fillScreen(COL_BG);  // writes all 240x320 GRAM cells
    tft.setRotation(1);      // MX|MV landscape: correct physical orientation
#else
    #ifdef ROTATE_180
        tft.setRotation(3);
    #else
        tft.setRotation(1);
    #endif
#endif
    tft.fillScreen(COL_BG);

